#include <REGX52.H>
#include "Timer0.h"
#include "Delay.h"
//github 使用
sbit Buzzer=P2^5;

#define SPEED   250 					//定义音符时长 500ms为一个4分音符
															//一拍长=SPEED/曲音符*以16分之1为基准1的音符数
															
//音符与索引对应表，P：休止符，L：低音，M：中音，H：高音，下划线：升半音符号#
#define x		0 															
#define L1 	1
#define L1_ 2
#define L2 	3
#define L2_ 4
#define L3	5
#define L4	6
#define	L4_	7
#define L5	8
#define L5_	9
#define L6	10
#define L6_	11
#define L7	12
#define M1 	13
#define M1_ 14
#define M2 	15
#define M2_ 16
#define M3	17
#define M4	18
#define	M4_	19
#define M5	20
#define M5_	21
#define M6	22
#define M6_	23
#define M7	24
#define H1 	25
#define H1_ 26
#define H2 	27
#define H2_ 28
#define H3	29
#define H4	30
#define	H4_	31
#define H5	32
#define H5_	33
#define H6	34
#define H6_	35
#define H7	36
#define B1 	37
#define B1_ 38
#define B2 	39
#define B2_ 40
#define B3	41
#define B4	42
#define	B4_	43
#define B5	44
#define B5_	45
#define B6	46
#define B6_	47
#define B7	48


unsigned int FreqTable[]=			//音符频率对应的重装载值 完成音高部分 第0个~第36个 跳过第0会哒哒响！
{		0,					
		63628,63731,63835,63928,64021,64103,64185,64260,64331,64400,64463,64524,
		64580,64633,64684,64732,64777,64820,64860,64898,64934,64968,65000,65030,
		65058,65085,65110,65134,65157,65178,65198,65217,65235,65252,65268,65283,
		65323,65335,65346,65357,65367,65377,65386,65394,65402,65409,65410,65411		
};

unsigned char FreqSelect=0,MusicSelect;		

unsigned char code Music[]=				//谱子时长紧跟音符
{										
	//1
		x,4,
		x,4,
		B3,4,
		B5,4,
	
		B2,4+4,
		B1,4,
		H7,2,
		B5,2,
	
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
	
		B1,4+4,
		H7,4,
		H6,4,
		
		
		x,4,
		x,4,
		x,4,
		x,4,
		
		M4,16,
		
		M5,16,
		
		M6,16,
		
	//2
		H3,2+2,
		B1,2+2,
		H7,2+2,
		H5,2,
		B5,2,
		
		B2,4+4,
		B1,4,
		H7,2,
		B5,2,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,16,
		
		L4,2,
		M1,2,
		M4,12,
		
		L5,2,
		M2,2,
		M5,12,
		
		L6,2,
		M3,2,
		M6,12,
		
	//3
		H3,4,
		B1,4,
		H7,4,
		H5,4,
		
		H6,2,
		H5,2,
		H6,2,
		B3,4,
		x,4,
		H6,2,
		
		H6,2,
		H5,2,
		H6,2,
		B2,6,
		B1,4,
		
		H7,4,
		H5,4,
		H3,4,
		H2,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		//4
		B1,4,
		H7,4,
		H6,4,
		H5,4,
		
		H6,2,
		H5,2,
		H6,2,
		B3,4,
		x,4,
		H6,2,
		
		H6,2,
		H5,2,
		H6,2,
		B2,6,
		B1,4,
		
		H7,6,
		H6,6,
		x,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//5
		H6,4,
		x,4,
		H3,4,
		H5,4,
		
		H2,8,
		H1,4,
		M7,2,
		H5,2,
		
		H2,8,
		H1,4,
		M7,2,
		H3,2,
		
		H1,8,
		M7,4,
		M6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//6
		H3,4,
		B1,4,
		H7,4,
		H5,4,
		
		B2,4,
		B1,4,
		M7,4,
		B5,4,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//7
		M3,4,
		H1,4,
		B1,2,
		H7,2,
		H6,2,
		H5,2,
		
		B2,4,
		B1,4,
		M7,4,
		B5,4,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		0xff																			//终止符
};

void main()
{			
		Timer0_Init();														//定时器1ms后溢出 调用中断函数
		while(1)																	//中断负责改频率，while负责赋予时间用作发声
		{
				if(Music[MusicSelect]!=0xff)
				{
				FreqSelect=Music[MusicSelect];				//调用谱子音高
			
				MusicSelect++;												//选取谱子音长
			
				Delay(SPEED/4*Music[MusicSelect]);		//调用谱子音长 Music[MusicSelect]
			
				MusicSelect++;												//选取谱子音高
					
				TR0=0;																//模拟抬手动作
				Delay(5);
				TR0=1;																//TR0=1允许T0开始计数
				}
				else
				{
						TR0=0;while(1);										//停止播放
//						MusicSelect=0;										//单曲循环
				}
		}
}

void Timer0_Routine() interrupt 1							//进入中断函数 音乐函数开始运行
{		
		if(FreqTable[FreqSelect])										//如果是休止符0 跳过，非0即1 运行
		{
				TL0 = FreqTable[FreqSelect]%256;			//音符 频率 周期 取整 重装载值
				TH0 = FreqTable[FreqSelect]/256;			//定时器模式1 16位重载
				Buzzer=!Buzzer;												//周期2ms 频率500HZ
		}
}

/* 小星星
		12,4,
		12,4,
		19,4,
		19,4,
		21,4,
		21,4,
		19,4+4,
		37,4,
		17,4,
		17,4,
		16,4,
		16,4,
		14,4,
		14,4,
		12,4+4,
*/
/* 天空之城
		//1
	x,	4,
	x,	4,
	x,	4,
	M6,	2,
	M7,	2,
	
	H1,	4+2,
	M7,	2,
	H1,	4,
	H3,	4,
	
	M7,	4+4+4,
	M3,	2,
	M3,	2,
	
	//2
	M6,	4+2,
	M5,	2,
	M6, 4,
	H1,	4,
	
	M5,	4+4+4,
	M3,	4,
	
	M4,	4+2,
	M3,	2,
	M4,	4,
	H1,	4,
	
	//3
	M3,	4+4,
	x,	2,
	H1,	2,
	H1,	2,
	H1,	2,
	
	M7,	4+2,
	M4_,2,
	M4_,4,
	M7,	4,
	
	M7,	8,
	x,	4,
	M6,	2,
	M7,	2,
	
	//4
	H1,	4+2,
	M7,	2,
	H1,	4,
	H3,	4,
	
	M7,	4+4+4,
	M3,	2,
	M3,	2,
	
	M6,	4+2,
	M5,	2,
	M6, 4,
	H1,	4,
	
	//5
	M5,	4+4+4,
	M2,	2,
	M3,	2,
	
	M4,	4,
	H1,	2,
	M7,	2+2,
	H1,	2+4,
	
	H2,	2,
	H2,	2,
	H3,	2,
	H1,	2+4+4,
	
	//6
	H1,	2,
	M7,	2,
	M6,	2,
	M6,	2,
	M7,	4,
	M5_,4,
	
	
	M6,	4+4+4,
	H1,	2,
	H2,	2,
	
	H3,	4+2,
	H2,	2,
	H3,	4,
	H5,	4,
	
	//7
	H2,	4+4+4,
	M5,	2,
	M5,	2,
	
	H1,	4+2,
	M7,	2,
	H1,	4,
	H3,	4,
	
	H3,	4+4+4+4,
	
	//8
	M6,	2,
	M7,	2,
	H1,	4,
	M7,	4,
	H2,	2,
	H2,	2,
	
	H1,	4+2,
	M5,	2+4+4,
	
	H4,	4,
	H3,	4,
	H3,	4,
	H1,	4,
	
	//9
	H3,	4+4+4,
	H3,	4,
	
	H6,	4+4,
	H5,	4,
	H5,	4,
	
	H3,	2,
	H2,	2,
	H1,	4+4,
	x,	2,
	H1,	2,
	
	//10
	H2,	4,
	H1,	2,
	H2,	2,
	H2,	4,
	H5,	4,
	
	H3,	4+4+4,
	H3,	4,
	
	H6,	4+4,
	H5,	4+4,
	
	//11
	H3,	2,
	H2,	2,
	H1,	4+4,
	x,	2,
	H1,	2,
	
	H2,	4,
	H1,	2,
	H2,	2+4,
	M7,	4,
	
	M6,	4+4+4,
	x,	4,
*/
/*
		音高 96 对应的频率为 2093.004522404789 Hz
		音高 97 对应的频率为 2217.4610478149766 Hz
		音高 98 对应的频率为 2349.318143339261 Hz
		音高 99 对应的频率为 2489.0158697766474 Hz
		音高 100 对应的频率为 2637.020455302959 Hz
		音高 101 对应的频率为 2793.8258514640315 Hz
		音高 102 对应的频率为 2959.955381693075 Hz
		音高 103 对应的频率为 3135.9634878539937 Hz
		音高 104 对应的频率为 3322.4375806395615 Hz
		音高 105 对应的频率为 3520.0 Hz
		音高 106 对应的频率为 3729.3100921447212 Hz
		音高 107 对应的频率为 3951.0664100489917 Hz
*/

/*
	//1
		x,4,
		x,4,
		B3,4,
		B5,4,
	
		B2,4+4,
		B1,4,
		H7,2,
		B5,2,
	
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
	
		B1,4+4,
		H7,4,
		H6,4,
		
		
		x,4,
		x,4,
		x,4,
		x,4,
		
		M4,16,
		
		M5,16,
		
		M6,16,
		
	//2
		H3,2+2,
		B1,2+2,
		H7,2+2,
		H5,2,
		B5,2,
		
		B2,4+4,
		B1,4,
		H7,2,
		B5,2,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,16,
		
		L4,2,
		M1,2,
		M4,12,
		
		L5,2,
		M2,2,
		M5,12,
		
		L6,2,
		M3,2,
		M6,12,
		
	//3
		H3,4,
		B1,4,
		H7,4,
		H5,4,
		
		H6,2,
		H5,2,
		H6,2,
		B3,4,
		x,4,
		H6,2,
		
		H6,2,
		H5,2,
		H6,2,
		B2,6,
		B1,4,
		
		H7,4,
		H5,4,
		H3,4,
		H2,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		//4
		B1,4,
		H7,4,
		H6,4,
		H5,4,
		
		H6,2,
		H5,2,
		H6,2,
		B3,4,
		x,4,
		H6,2,
		
		H6,2,
		H5,2,
		H6,2,
		B2,6,
		B1,4,
		
		H7,6,
		H6,6,
		x,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//5
		H6,4,
		x,4,
		H3,4,
		H5,4,
		
		H2,8,
		H1,4,
		M7,2,
		H5,2,
		
		H2,8,
		H1,4,
		M7,2,
		H3,2,
		
		H1,8,
		M7,4,
		M6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//6
		H3,4,
		B1,4,
		H7,4,
		H5,4,
		
		B2,4,
		B1,4,
		M7,4,
		B5,4,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
	//7
		M3,4,
		H1,4,
		B1,2,
		H7,2,
		H6,2,
		H5,2,
		
		B2,4,
		B1,4,
		M7,4,
		B5,4,
		
		B2,4+4,
		B1,4,
		H7,2,
		B3,2,
		
		B1,8,
		H7,4,
		H6,4,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
		
		L4,2,
		M1,2,
		M4,4,
		x,8,
		
		L5,2,
		M2,2,
		M5,4,
		x,8,
		
		L6,2,
		M3,2,
		M6,4,
		x,8,
*/